In [2]:
import mysql.connector as sql
import pandas as pd

# auth_plugin is needed, can check by commends 
# SELECT user,authentication_string,plugin,host FROM mysql.user;
# check the columns plugin and user

mydb = sql.connect (
    host = "localhost",
    user = "root",
    password = "ZAQs8271911c$",
    auth_plugin='mysql_native_password',
    database = "sql_intro",
    buffered = True             # Unread result found issue
)                                              # if using pandas no need to use buffer

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x7f4ac8fba350>

# doing simple calculation by sql

In [7]:
#10 + 120

sql_query = """
select (10 + 120)
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   (10 + 120)
0         130

In [15]:
#ORDER DATA IN DESC ORDER
"""sales
	product_id	sell_price	qty	    state
0	121	                320.0	    3	        california
1	121	                320.0	    6	        taxas
2	121	                320.0	    4	        alaska
3	123	                290.0	    2	        taxas
4	123	                290.0	    7	        california
5	123	                290.0	    4	        washington
6	121	                320.0	    7	        ohio
7	121	                320.0	    2	        Arizona
8	123	                290.0	    8	        colorado
"""

sql_query = """
select *
FROM sales;
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   product_id  sell_price  qty       state
0         121       320.0    3  california
1         121       320.0    6       taxas
2         121       320.0    4      alaska
3         123       290.0    2       taxas
4         123       290.0    7  california
5         123       290.0    4  washington
6         121       320.0    7        ohio
7         121       320.0    2     Arizona
8         123       290.0    8    colorado

# length()
#### calculate length of letters in a string

In [8]:
sql_query = """
select  LENGTH("TAIWAN")
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

   LENGTH("TAIWAN")
0                 6

# REPEAT()

In [11]:
#10 + 120 AND REPEAT 3 TIMES

sql_query = """
select REPEAT(10 + 120,3)
"""

df = pd.read_sql_query(
    sql_query,
    mydb)
df

/home/bruce/.local/lib/python3.10/site-packages/pandas/io/sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

  REPEAT(10 + 120,3)
0          130130130